### Terraform Plan Output
```hcl
[command]/home/runner/work/_temp/e73de0a8-65f9-4316-84f2-ca36b7f5073f/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cloudfront.aws_cloudfront_distribution.frontend will be created
  + resource "aws_cloudfront_distribution" "frontend" {
      + aliases                         = [
          + "dev.innovatefuture.foundation",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev.innovatefuture.foundation-distribution"
          + "Owner"       = "IFA"
          + "Project"     = "IFF"
          + "Service"     = "Content Delivery"
        }
      + tags_all                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev.innovatefuture.foundation-distribution"
          + "Owner"       = "IFA"
          + "Project"     = "IFF"
          + "Service"     = "Content Delivery"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = "67f7725c-6f97-4210-82d7-5512b31e9d03"
          + target_origin_id           = "S3-dev.innovatefuture.foundation"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "S3-dev.innovatefuture.foundation"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.frontend will be created
  + resource "aws_cloudfront_origin_access_control" "frontend" {
      + description                       = "Origin Access Control for frontend static website"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "dev.innovatefuture.foundation-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.route53_acm.aws_acm_certificate.frontend will be created
  + resource "aws_acm_certificate" "frontend" {
      + arn                       = (known after apply)
      + domain_name               = "dev.innovatefuture.foundation"
      + domain_validation_options = [
          + {
              + domain_name           = "dev.innovatefuture.foundation"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "dev.innovatefuture.foundation",
        ]
      + tags                      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev.innovatefuture.foundation-certificate"
          + "Owner"       = "IFA"
          + "Project"     = "IFF"
          + "Service"     = "SSL Certificate"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev.innovatefuture.foundation-certificate"
          + "Owner"       = "IFA"
          + "Project"     = "IFF"
          + "Service"     = "SSL Certificate"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.route53_acm.aws_acm_certificate_validation.frontend will be created
  + resource "aws_acm_certificate_validation" "frontend" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.route53_acm.aws_route53_record.acm_validation["dev.innovatefuture.foundation"] will be created
  + resource "aws_route53_record" "acm_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0802797114DVNCGZ0O39"
    }

  # module.route53_acm.aws_route53_record.frontend will be created
  + resource "aws_route53_record" "frontend" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev.innovatefuture.foundation"
      + type            = "A"
      + zone_id         = "Z0802797114DVNCGZ0O39"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.s3.data.aws_iam_policy_document.frontend_s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "frontend_s3_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3.aws_s3_bucket.frontend will be created
  + resource "aws_s3_bucket" "frontend" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-foundation-innovatefuture-dev-frontend-static"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-foundation-innovatefuture-dev-frontend-static-frontend-bucket"
          + "Owner"       = "IFA"
          + "Project"     = "IFF"
          + "Service"     = "Static Website Hosting"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-foundation-innovatefuture-dev-frontend-static-frontend-bucket"
          + "Owner"       = "IFA"
          + "Project"     = "IFF"
          + "Service"     = "Static Website Hosting"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_policy.frontend will be created
  + resource "aws_s3_bucket_policy" "frontend" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3.aws_s3_bucket_public_access_block.frontend will be created
  + resource "aws_s3_bucket_public_access_block" "frontend" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3.aws_s3_bucket_server_side_encryption_configuration.frontend will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "frontend" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3.aws_s3_bucket_versioning.frontend will be created
  + resource "aws_s3_bucket_versioning" "frontend" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acm_certificate_arn         = (known after apply)
  + cloudfront_distribution_id  = (known after apply)
  + cloudfront_distribution_url = (known after apply)
  + s3_bucket                   = (known after apply)
  + website_domain              = "dev.innovatefuture.foundation"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.cloudfront.aws_cloudfront_distribution.frontend will be created%0A  + resource "aws_cloudfront_distribution" "frontend" {%0A      + aliases                         = [%0A          + "dev.innovatefuture.foundation",%0A        ]%0A      + arn                             = (known after apply)%0A      + caller_reference                = (known after apply)%0A      + continuous_deployment_policy_id = (known after apply)%0A      + default_root_object             = "index.html"%0A      + domain_name                     = (known after apply)%0A      + enabled                         = true%0A      + etag                            = (known after apply)%0A      + hosted_zone_id                  = (known after apply)%0A      + http_version                    = "http2"%0A      + id                              = (known after apply)%0A      + in_progress_validation_batches  = (known after apply)%0A      + is_ipv6_enabled                 = true%0A      + last_modified_time              = (known after apply)%0A      + price_class                     = "PriceClass_All"%0A      + retain_on_delete                = false%0A      + staging                         = false%0A      + status                          = (known after apply)%0A      + tags                            = {%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "Terraform"%0A          + "Name"        = "dev.innovatefuture.foundation-distribution"%0A          + "Owner"       = "IFA"%0A          + "Project"     = "IFF"%0A          + "Service"     = "Content Delivery"%0A        }%0A      + tags_all                        = {%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "Terraform"%0A          + "Name"        = "dev.innovatefuture.foundation-distribution"%0A          + "Owner"       = "IFA"%0A          + "Project"     = "IFF"%0A          + "Service"     = "Content Delivery"%0A        }%0A      + trusted_key_groups              = (known after apply)%0A      + trusted_signers                 = (known after apply)%0A      + wait_for_deployment             = true%0A%0A      + custom_error_response {%0A          + error_code         = 403%0A          + response_code      = 200%0A          + response_page_path = "/index.html"%0A        }%0A      + custom_error_response {%0A          + error_code         = 404%0A          + response_code      = 200%0A          + response_page_path = "/index.html"%0A        }%0A%0A      + default_cache_behavior {%0A          + allowed_methods            = [%0A              + "GET",%0A              + "HEAD",%0A              + "OPTIONS",%0A            ]%0A          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"%0A          + cached_methods             = [%0A              + "GET",%0A              + "HEAD",%0A            ]%0A          + compress                   = true%0A          + default_ttl                = (known after apply)%0A          + max_ttl                    = (known after apply)%0A          + min_ttl                    = 0%0A          + response_headers_policy_id = "67f7725c-6f97-4210-82d7-5512b31e9d03"%0A          + target_origin_id           = "S3-dev.innovatefuture.foundation"%0A          + trusted_key_groups         = (known after apply)%0A          + trusted_signers            = (known after apply)%0A          + viewer_protocol_policy     = "redirect-to-https"%0A        }%0A%0A      + origin {%0A          + connection_attempts      = 3%0A          + connection_timeout       = 10%0A          + domain_name              = (known after apply)%0A          + origin_access_control_id = (known after apply)%0A          + origin_id                = "S3-dev.innovatefuture.foundation"%0A        }%0A%0A      + restrictions {%0A          + geo_restriction {%0A              + locations        = (known after apply)%0A              + restriction_type = "none"%0A            }%0A        }%0A%0A      + viewer_certificate {%0A          + acm_certificate_arn      = (known after apply)%0A          + minimum_protocol_version = "TLSv1.2_2021"%0A          + ssl_support_method       = "sni-only"%0A        }%0A    }%0A%0A  # module.cloudfront.aws_cloudfront_origin_access_control.frontend will be created%0A  + resource "aws_cloudfront_origin_access_control" "frontend" {%0A      + description                       = "Origin Access Control for frontend static website"%0A      + etag                              = (known after apply)%0A      + id                                = (known after apply)%0A      + name                              = "dev.innovatefuture.foundation-oac"%0A      + origin_access_control_origin_type = "s3"%0A      + signing_behavior                  = "always"%0A      + signing_protocol                  = "sigv4"%0A    }%0A%0A  # module.route53_acm.aws_acm_certificate.frontend will be created%0A  + resource "aws_acm_certificate" "frontend" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "dev.innovatefuture.foundation"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "dev.innovatefuture.foundation"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "dev.innovatefuture.foundation",%0A        ]%0A      + tags                      = {%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "Terraform"%0A          + "Name"        = "dev.innovatefuture.foundation-certificate"%0A          + "Owner"       = "IFA"%0A          + "Project"     = "IFF"%0A          + "Service"     = "SSL Certificate"%0A        }%0A      + tags_all                  = {%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "Terraform"%0A          + "Name"        = "dev.innovatefuture.foundation-certificate"%0A          + "Owner"       = "IFA"%0A          + "Project"     = "IFF"%0A          + "Service"     = "SSL Certificate"%0A        }%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A    }%0A%0A  # module.route53_acm.aws_acm_certificate_validation.frontend will be created%0A  + resource "aws_acm_certificate_validation" "frontend" {%0A      + certificate_arn         = (known after apply)%0A      + id                      = (known after apply)%0A      + validation_record_fqdns = (known after apply)%0A    }%0A%0A  # module.route53_acm.aws_route53_record.acm_validation["dev.innovatefuture.foundation"] will be created%0A  + resource "aws_route53_record" "acm_validation" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + zone_id         = "Z0802797114DVNCGZ0O39"%0A    }%0A%0A  # module.route53_acm.aws_route53_record.frontend will be created%0A  + resource "aws_route53_record" "frontend" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "dev.innovatefuture.foundation"%0A      + type            = "A"%0A      + zone_id         = "Z0802797114DVNCGZ0O39"%0A%0A      + alias {%0A          + evaluate_target_health = false%0A          + name                   = (known after apply)%0A          + zone_id                = (known after apply)%0A        }%0A    }%0A%0A  # module.s3.data.aws_iam_policy_document.frontend_s3_policy will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "frontend_s3_policy" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:GetObject",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A%0A          + condition {%0A              + test     = "StringEquals"%0A              + values   = [%0A                  + (known after apply),%0A                ]%0A              + variable = "AWS:SourceArn"%0A            }%0A%0A          + principals {%0A              + identifiers = [%0A                  + "cloudfront.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.s3.aws_s3_bucket.frontend will be created%0A  + resource "aws_s3_bucket" "frontend" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "dev-foundation-innovatefuture-dev-frontend-static"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "Terraform"%0A          + "Name"        = "dev-foundation-innovatefuture-dev-frontend-static-frontend-bucket"%0A          + "Owner"       = "IFA"%0A          + "Project"     = "IFF"%0A          + "Service"     = "Static Website Hosting"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "Terraform"%0A          + "Name"        = "dev-foundation-innovatefuture-dev-frontend-static-frontend-bucket"%0A          + "Owner"       = "IFA"%0A          + "Project"     = "IFF"%0A          + "Service"     = "Static Website Hosting"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_policy.frontend will be created%0A  + resource "aws_s3_bucket_policy" "frontend" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_public_access_block.frontend will be created%0A  + resource "aws_s3_bucket_public_access_block" "frontend" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.s3.aws_s3_bucket_server_side_encryption_configuration.frontend will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "frontend" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + sse_algorithm = "AES256"%0A            }%0A        }%0A    }%0A%0A  # module.s3.aws_s3_bucket_versioning.frontend will be created%0A  + resource "aws_s3_bucket_versioning" "frontend" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 11 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + acm_certificate_arn         = (known after apply)%0A  + cloudfront_distribution_id  = (known after apply)%0A  + cloudfront_distribution_url = (known after apply)%0A  + s3_bucket                   = (known after apply)%0A  + website_domain              = "dev.innovatefuture.foundation"%0A
::debug::stderr: 
::debug::exitcode: 0

```